"""
Задание
Создайте приложение для эмуляции работы пиццерии. 
Приложение должноиметь следующую функциональность:
1. Пользователь может выбрать из пяти стандартных 
рецептов пиццы или создать свой рецепт.
2. Пользователь может выбирать добавлять литоппин
ги (сладкий лук, халапеньо, чили, соленный огурец, 
оливки, прошутто и т.д.).
3. Информацию о заказанной пицце нужно отображать 
на экран и сохранять в файл.
4. Расчет может производиться, как наличными, так и 
картой.
5. Необходимо иметь возможность просмотреть коли
чество проданных пицц, выручку, прибыль.
6. Классы приложения должныбыть построены  уче
том принципов SOLID и паттернов проектирования

"""
from abc import ABC, abstractmethod
